MikroElektronika/core_packages/PIC/XC8/def/PIC16LF18446/mcu.h
#define                                 NCO1INC9_bit        _BIT_ACCESS(NCO1INCH,1)
// PMD2<NCO1MD>
extern volatile __bit                   NCO1MD              __at(0x3CC7);	// @ (0x798 * 8 + 7)
#define                                 NCO1MD_bit          _BIT_ACCESS(PMD2,7)
// NCO1CON<NCO1OUT>
extern volatile __bit                   NCO1OUT             __at(0x2C95);	// @ (0x592 * 8 + 5)
#define                                 NCO1OUT_bit         _BIT_ACCESS(NCO1CON,5)
// NCO1CON<NCO1PFM>
extern volatile __bit                   NCO1PFM             __at(0x2C90);	// @ (0x592 * 8 + 0)
#define                                 NCO1PFM_bit         _BIT_ACCESS(NCO1CON,0)
// NCO1CON<NCO1POL>
extern volatile __bit                   NCO1POL             __at(0x2C94);	// @ (0x592 * 8 + 4)
#define                                 NCO1POL_bit         _BIT_ACCESS(NCO1CON,4)
// NCO1CLK<NCO1PWS0>
extern volatile __bit                   NCO1PWS0            __at(0x2C9D);	// @ (0x593 * 8 + 5)
#define                                 NCO1PWS0_bit        _BIT_ACCESS(NCO1CLK,5)
// NCO1CLK<NCO1PWS1>
extern volatile __bit                   NCO1PWS1            __at(0x2C9E);	// @ (0x593 * 8 + 6)
#define                                 NCO1PWS1_bit        _BIT_ACCESS(NCO1CLK,6)
// NCO1CLK<NCO1PWS2>
extern volatile __bit                   NCO1PWS2            __at(0x2C9F);	// @ (0x593 * 8 + 7)
#define                                 NCO1PWS2_bit        _BIT_ACCESS(NCO1CLK,7)
// PIE7<NCOIE>
extern volatile __bit                   NCOIE               __at(0x38EC);	// @ (0x71D * 8 + 4)
#define                                 NCOIE_bit           _BIT_ACCESS(PIE7,4)
// OSCCON1<NDIV0>
extern volatile __bit                   NDIV0               __at(0x4468);	// @ (0x88D * 8 + 0)
#define                                 NDIV0_bit           _BIT_ACCESS(OSCCON1,0)
// OSCCON1<NDIV1>
extern volatile __bit                   NDIV1               __at(0x4469);	// @ (0x88D * 8 + 1)
#define                                 NDIV1_bit           _BIT_ACCESS(OSCCON1,1)
// OSCCON1<NDIV2>
extern volatile __bit                   NDIV2               __at(0x446A);	// @ (0x88D * 8 + 2)
#define                                 NDIV2_bit           _BIT_ACCESS(OSCCON1,2)
// OSCCON1<NDIV3>
extern volatile __bit                   NDIV3               __at(0x446B);	// @ (0x88D * 8 + 3)
#define                                 NDIV3_bit           _BIT_ACCESS(OSCCON1,3)
// OSCCON1<NOSC0>
extern volatile __bit                   NOSC0               __at(0x446C);	// @ (0x88D * 8 + 4)
#define                                 NOSC0_bit           _BIT_ACCESS(OSCCON1,4)
// OSCCON1<NOSC1>
extern volatile __bit                   NOSC1               __at(0x446D);	// @ (0x88D * 8 + 5)
#define                                 NOSC1_bit           _BIT_ACCESS(OSCCON1,5)
// OSCCON1<NOSC2>
extern volatile __bit                   NOSC2               __at(0x446E);	// @ (0x88D * 8 + 6)
#define                                 NOSC2_bit           _BIT_ACCESS(OSCCON1,6)
// OSCCON3<NOSCR>
extern volatile __bit                   NOSCR               __at(0x447B);	// @ (0x88F * 8 + 3)
#define                                 NOSCR_bit           _BIT_ACCESS(OSCCON3,3)
// T1GCON<NOT_T1DONE>
extern volatile __bit                   NOT_T1DONE          __at(0x107B);	// @ (0x20F * 8 + 3)
#define                                 NOT_T1DONE_bit      _BIT_ACCESS(T1GCON,3)
// T1CON<NOT_T1SYNC>
extern volatile __bit                   NOT_T1SYNC          __at(0x1072);	// @ (0x20E * 8 + 2)
#define                                 NOT_T1SYNC_bit      _BIT_ACCESS(T1CON,2)
// T3GCON<NOT_T3DONE>
extern volatile __bit                   NOT_T3DONE          __at(0x10AB);	// @ (0x215 * 8 + 3)
#define                                 NOT_T3DONE_bit      _BIT_ACCESS(T3GCON,3)
// T3CON<NOT_T3SYNC>
extern volatile __bit                   NOT_T3SYNC          __at(0x10A2);	// @ (0x214 * 8 + 2)
#define                                 NOT_T3SYNC_bit      _BIT_ACCESS(T3CON,2)
// T5GCON<NOT_T5DONE>
extern volatile __bit                   NOT_T5DONE          __at(0x10DB);	// @ (0x21B * 8 + 3)
#define                                 NOT_T5DONE_bit      _BIT_ACCESS(T5GCON,3)
// T5CON<NOT_T5SYNC>
extern volatile __bit                   NOT_T5SYNC          __at(0x10D2);	// @ (0x21A * 8 + 2)
#define                                 NOT_T5SYNC_bit      _BIT_ACCESS(T5CON,2)
// ADREF<NREF0>
extern volatile __bit                   NREF0               __at(0x8B4);	// @ (0x116 * 8 + 4)
#define                                 NREF0_bit           _BIT_ACCESS(ADREF,4)
// DAC1CON0<NSS>
extern volatile __bit                   NSS                 __at(0x4870);	// @ (0x90E * 8 + 0)
#define                                 NSS_bit             _BIT_ACCESS(DAC1CON0,0)
// NVMADRH<NVMADRH0>
extern volatile __bit                   NVMADRH0            __at(0x40D8);	// @ (0x81B * 8 + 0)
#define                                 NVMADRH0_bit        _BIT_ACCESS(NVMADRH,0)
// NVMADRH<NVMADRH1>
extern volatile __bit                   NVMADRH1            __at(0x40D9);	// @ (0x81B * 8 + 1)
#define                                 NVMADRH1_bit        _BIT_ACCESS(NVMADRH,1)
// NVMADRH<NVMADRH2>
extern volatile __bit                   NVMADRH2            __at(0x40DA);	// @ (0x81B * 8 + 2)
#define                                 NVMADRH2_bit        _BIT_ACCESS(NVMADRH,2)
// NVMADRH<NVMADRH3>
extern volatile __bit                   NVMADRH3            __at(0x40DB);	// @ (0x81B * 8 + 3)
#define                                 NVMADRH3_bit        _BIT_ACCESS(NVMADRH,3)
// NVMADRH<NVMADRH4>
extern volatile __bit                   NVMADRH4            __at(0x40DC);	// @ (0x81B * 8 + 4)
#define                                 NVMADRH4_bit        _BIT_ACCESS(NVMADRH,4)
// NVMADRH<NVMADRH5>
extern volatile __bit                   NVMADRH5            __at(0x40DD);	// @ (0x81B * 8 + 5)
#define                                 NVMADRH5_bit        _BIT_ACCESS(NVMADRH,5)
// NVMADRH<NVMADRH6>
extern volatile __bit                   NVMADRH6            __at(0x40DE);	// @ (0x81B * 8 + 6)
#define                                 NVMADRH6_bit        _BIT_ACCESS(NVMADRH,6)
// NVMADRL<NVMADRL0>
extern volatile __bit                   NVMADRL0            __at(0x40D0);	// @ (0x81A * 8 + 0)
#define                                 NVMADRL0_bit        _BIT_ACCESS(NVMADRL,0)
// NVMADRL<NVMADRL1>
extern volatile __bit                   NVMADRL1            __at(0x40D1);	// @ (0x81A * 8 + 1)
#define                                 NVMADRL1_bit        _BIT_ACCESS(NVMADRL,1)
// NVMADRL<NVMADRL2>
extern volatile __bit                   NVMADRL2            __at(0x40D2);	// @ (0x81A * 8 + 2)
#define                                 NVMADRL2_bit        _BIT_ACCESS(NVMADRL,2)
// NVMADRL<NVMADRL3>
extern volatile __bit                   NVMADRL3            __at(0x40D3);	// @ (0x81A * 8 + 3)
#define                                 NVMADRL3_bit        _BIT_ACCESS(NVMADRL,3)
// NVMADRL<NVMADRL4>
extern volatile __bit                   NVMADRL4            __at(0x40D4);	// @ (0x81A * 8 + 4)
#define                                 NVMADRL4_bit        _BIT_ACCESS(NVMADRL,4)
// NVMADRL<NVMADRL5>
extern volatile __bit                   NVMADRL5            __at(0x40D5);	// @ (0x81A * 8 + 5)
#define                                 NVMADRL5_bit        _BIT_ACCESS(NVMADRL,5)
// NVMADRL<NVMADRL6>
extern volatile __bit                   NVMADRL6            __at(0x40D6);	// @ (0x81A * 8 + 6)
#define                                 NVMADRL6_bit        _BIT_ACCESS(NVMADRL,6)
// NVMADRL<NVMADRL7>
extern volatile __bit                   NVMADRL7            __at(0x40D7);	// @ (0x81A * 8 + 7)
#define                                 NVMADRL7_bit        _BIT_ACCESS(NVMADRL,7)
// NVMDATH<NVMDATH0>
extern volatile __bit                   NVMDATH0            __at(0x40E8);	// @ (0x81D * 8 + 0)
#define                                 NVMDATH0_bit        _BIT_ACCESS(NVMDATH,0)
// NVMDATH<NVMDATH1>
extern volatile __bit                   NVMDATH1            __at(0x40E9);	// @ (0x81D * 8 + 1)
#define                                 NVMDATH1_bit        _BIT_ACCESS(NVMDATH,1)
// NVMDATH<NVMDATH2>
extern volatile __bit                   NVMDATH2            __at(0x40EA);	// @ (0x81D * 8 + 2)
#define                                 NVMDATH2_bit        _BIT_ACCESS(NVMDATH,2)
// NVMDATH<NVMDATH3>
extern volatile __bit                   NVMDATH3            __at(0x40EB);	// @ (0x81D * 8 + 3)
#define                                 NVMDATH3_bit        _BIT_ACCESS(NVMDATH,3)
// NVMDATH<NVMDATH4>
extern volatile __bit                   NVMDATH4            __at(0x40EC);	// @ (0x81D * 8 + 4)
#define                                 NVMDATH4_bit        _BIT_ACCESS(NVMDATH,4)
// NVMDATH<NVMDATH5>
extern volatile __bit                   NVMDATH5            __at(0x40ED);	// @ (0x81D * 8 + 5)
#define                                 NVMDATH5_bit        _BIT_ACCESS(NVMDATH,5)
// NVMDATL<NVMDATL0>
extern volatile __bit                   NVMDATL0            __at(0x40E0);	// @ (0x81C * 8 + 0)
#define                                 NVMDATL0_bit        _BIT_ACCESS(NVMDATL,0)
// NVMDATL<NVMDATL1>
extern volatile __bit                   NVMDATL1            __at(0x40E1);	// @ (0x81C * 8 + 1)
#define                                 NVMDATL1_bit        _BIT_ACCESS(NVMDATL,1)
// NVMDATL<NVMDATL2>
extern volatile __bit                   NVMDATL2            __at(0x40E2);	// @ (0x81C * 8 + 2)
#define                                 NVMDATL2_bit        _BIT_ACCESS(NVMDATL,2)
// NVMDATL<NVMDATL3>
extern volatile __bit                   NVMDATL3            __at(0x40E3);	// @ (0x81C * 8 + 3)
#define                                 NVMDATL3_bit        _BIT_ACCESS(NVMDATL,3)
// NVMDATL<NVMDATL4>
extern volatile __bit                   NVMDATL4            __at(0x40E4);	// @ (0x81C * 8 + 4)
#define                                 NVMDATL4_bit        _BIT_ACCESS(NVMDATL,4)
// NVMDATL<NVMDATL5>
extern volatile __bit                   NVMDATL5            __at(0x40E5);	// @ (0x81C * 8 + 5)
#define                                 NVMDATL5_bit        _BIT_ACCESS(NVMDATL,5)
// NVMDATL<NVMDATL6>
extern volatile __bit                   NVMDATL6            __at(0x40E6);	// @ (0x81C * 8 + 6)
#define                                 NVMDATL6_bit        _BIT_ACCESS(NVMDATL,6)
// NVMDATL<NVMDATL7>
extern volatile __bit                   NVMDATL7            __at(0x40E7);	// @ (0x81C * 8 + 7)
#define                                 NVMDATL7_bit        _BIT_ACCESS(NVMDATL,7)
// PIE7<NVMIE>
extern volatile __bit                   NVMIE               __at(0x38ED);	// @ (0x71D * 8 + 5)
#define                                 NVMIE_bit           _BIT_ACCESS(PIE7,5)
// PIR7<NVMIF>
extern volatile __bit                   NVMIF               __at(0x389D);	// @ (0x713 * 8 + 5)
#define                                 NVMIF_bit           _BIT_ACCESS(PIR7,5)
// PMD0<NVMMD>
extern volatile __bit                   NVMMD               __at(0x3CB2);	// @ (0x796 * 8 + 2)
#define                                 NVMMD_bit           _BIT_ACCESS(PMD0,2)
// NVMCON1<NVMREGS>
extern volatile __bit                   NVMREGS             __at(0x40F6);	// @ (0x81E * 8 + 6)
#define                                 NVMREGS_bit         _BIT_ACCESS(NVMCON1,6)
// ODCONA<ODCA0>
extern volatile __bit                   ODCA0               __at(0xF9D0);	// @ (0x1F3A * 8 + 0)
#define                                 ODCA0_bit           _BIT_ACCESS(ODCONA,0)
// ODCONA<ODCA1>
extern volatile __bit                   ODCA1               __at(0xF9D1);	// @ (0x1F3A * 8 + 1)
#define                                 ODCA1_bit           _BIT_ACCESS(ODCONA,1)
// ODCONA<ODCA2>
extern volatile __bit                   ODCA2               __at(0xF9D2);	// @ (0x1F3A * 8 + 2)
#define                                 ODCA2_bit           _BIT_ACCESS(ODCONA,2)
// ODCONA<ODCA4>
extern volatile __bit                   ODCA4               __at(0xF9D4);	// @ (0x1F3A * 8 + 4)
#define                                 ODCA4_bit           _BIT_ACCESS(ODCONA,4)
// ODCONA<ODCA5>
extern volatile __bit                   ODCA5               __at(0xF9D5);	// @ (0x1F3A * 8 + 5)
#define                                 ODCA5_bit           _BIT_ACCESS(ODCONA,5)
// ODCONB<ODCB4>
extern volatile __bit                   ODCB4               __at(0xFA2C);	// @ (0x1F45 * 8 + 4)
#define                                 ODCB4_bit           _BIT_ACCESS(ODCONB,4)
// ODCONB<ODCB5>
extern volatile __bit                   ODCB5               __at(0xFA2D);	// @ (0x1F45 * 8 + 5)
#define                                 ODCB5_bit           _BIT_ACCESS(ODCONB,5)
// ODCONB<ODCB6>
extern volatile __bit                   ODCB6               __at(0xFA2E);	// @ (0x1F45 * 8 + 6)
#define                                 ODCB6_bit           _BIT_ACCESS(ODCONB,6)
// ODCONB<ODCB7>
extern volatile __bit                   ODCB7               __at(0xFA2F);	// @ (0x1F45 * 8 + 7)
#define                                 ODCB7_bit           _BIT_ACCESS(ODCONB,7)
// ODCONC<ODCC0>
extern volatile __bit                   ODCC0               __at(0xFA80);	// @ (0x1F50 * 8 + 0)
#define                                 ODCC0_bit           _BIT_ACCESS(ODCONC,0)
// ODCONC<ODCC1>
extern volatile __bit                   ODCC1               __at(0xFA81);	// @ (0x1F50 * 8 + 1)
#define                                 ODCC1_bit           _BIT_ACCESS(ODCONC,1)
// ODCONC<ODCC2>
extern volatile __bit                   ODCC2               __at(0xFA82);	// @ (0x1F50 * 8 + 2)
#define                                 ODCC2_bit           _BIT_ACCESS(ODCONC,2)
// ODCONC<ODCC3>
extern volatile __bit                   ODCC3               __at(0xFA83);	// @ (0x1F50 * 8 + 3)
#define                                 ODCC3_bit           _BIT_ACCESS(ODCONC,3)
// ODCONC<ODCC4>
extern volatile __bit                   ODCC4               __at(0xFA84);	// @ (0x1F50 * 8 + 4)
#define                                 ODCC4_bit           _BIT_ACCESS(ODCONC,4)
// ODCONC<ODCC5>
extern volatile __bit                   ODCC5               __at(0xFA85);	// @ (0x1F50 * 8 + 5)
#define                                 ODCC5_bit           _BIT_ACCESS(ODCONC,5)
// ODCONC<ODCC6>
extern volatile __bit                   ODCC6               __at(0xFA86);	// @ (0x1F50 * 8 + 6)
#define                                 ODCC6_bit           _BIT_ACCESS(ODCONC,6)
// ODCONC<ODCC7>
extern volatile __bit                   ODCC7               __at(0xFA87);	// @ (0x1F50 * 8 + 7)
#define                                 ODCC7_bit           _BIT_ACCESS(ODCONC,7)
// DAC1CON0<OE1>
extern volatile __bit                   OE1                 __at(0x4875);	// @ (0x90E * 8 + 5)
#define                                 OE1_bit             _BIT_ACCESS(DAC1CON0,5)
// RC1STA<OERR>
extern volatile __bit                   OERR                __at(0x8E9);	// @ (0x11D * 8 + 1)
#define                                 OERR_bit            _BIT_ACCESS(RC1STA,1)
// MD1CON0<OPOL>
extern volatile __bit                   OPOL                __at(0x44BC);	// @ (0x897 * 8 + 4)
#define                                 OPOL_bit            _BIT_ACCESS(MD1CON0,4)
// OSCCON3<ORDY>
extern volatile __bit                   ORDY                __at(0x447C);	// @ (0x88F * 8 + 4)
#define                                 ORDY_bit            _BIT_ACCESS(OSCCON3,4)
// PIE1<OSFIE>
extern volatile __bit                   OSFIE               __at(0x38BF);	// @ (0x717 * 8 + 7)
#define                                 OSFIE_bit           _BIT_ACCESS(PIE1,7)
// PIR1<OSFIF>
extern volatile __bit                   OSFIF               __at(0x386F);	// @ (0x70D * 8 + 7)
#define                                 OSFIF_bit           _BIT_ACCESS(PIR1,7)
// ADSTAT<OV>
extern volatile __bit                   OV                  __at(0x8AF);	// @ (0x115 * 8 + 7)
#define                                 OV_bit              _BIT_ACCESS(ADSTAT,7)
// ADPCH<PCH3>
extern volatile __bit                   PCH3                __at(0x4FB);	// @ (0x9F * 8 + 3)
#define                                 PCH3_bit            _BIT_ACCESS(ADPCH,3)
// ADPCH<PCH4>
extern volatile __bit                   PCH4                __at(0x4FC);	// @ (0x9F * 8 + 4)
#define                                 PCH4_bit            _BIT_ACCESS(ADPCH,4)
// ADPCH<PCH5>
extern volatile __bit                   PCH5                __at(0x4FD);	// @ (0x9F * 8 + 5)
#define                                 PCH5_bit            _BIT_ACCESS(ADPCH,5)
// INTCON<PEIE>
extern volatile __bit                   PEIE                __at(0x5E);	// @ (0xB * 8 + 6)
#define                                 PEIE_bit            _BIT_ACCESS(INTCON,6)
// SSP1CON2<PEN1>
extern volatile __bit                   PEN1                __at(0xC8A);	// @ (0x191 * 8 + 2)
#define                                 PEN1_bit            _BIT_ACCESS(SSP1CON2,2)
// SSP2CON2<PEN2>
extern volatile __bit                   PEN2                __at(0xCDA);	// @ (0x19B * 8 + 2)
#define                                 PEN2_bit            _BIT_ACCESS(SSP2CON2,2)
// NCO1CON<PFM>
extern volatile __bit                   PFM                 __at(0x2C90);	// @ (0x592 * 8 + 0)
#define                                 PFM_bit             _BIT_ACCESS(NCO1CON,0)
// OSCSTAT<PLLR>
extern volatile __bit                   PLLR                __at(0x4480);	// @ (0x890 * 8 + 0)
#define                                 PLLR_bit            _BIT_ACCESS(OSCSTAT,0)
// ADCON1<PPOL>
extern volatile __bit                   PPOL                __at(0x897);	// @ (0x112 * 8 + 7)
#define                                 PPOL_bit            _BIT_ACCESS(ADCON1,7)
// PPSLOCK<PPSLOCKED>
extern volatile __bit                   PPSLOCKED           __at(0xF478);	// @ (0x1E8F * 8 + 0)
#define                                 PPSLOCKED_bit       _BIT_ACCESS(PPSLOCK,0)
// SMT1PRH<PR10>
extern volatile __bit                   PR10                __at(0x24B2);	// @ (0x496 * 8 + 2)
#define                                 PR10_bit            _BIT_ACCESS(SMT1PRH,2)
// SMT1PRH<PR11>
extern volatile __bit                   PR11                __at(0x24B3);	// @ (0x496 * 8 + 3)
#define                                 PR11_bit            _BIT_ACCESS(SMT1PRH,3)
// SMT1PRH<PR12>
extern volatile __bit                   PR12                __at(0x24B4);	// @ (0x496 * 8 + 4)
#define                                 PR12_bit            _BIT_ACCESS(SMT1PRH,4)
// SMT1PRH<PR13>
extern volatile __bit                   PR13                __at(0x24B5);	// @ (0x496 * 8 + 5)
#define                                 PR13_bit            _BIT_ACCESS(SMT1PRH,5)
// SMT1PRH<PR14>
extern volatile __bit                   PR14                __at(0x24B6);	// @ (0x496 * 8 + 6)
#define                                 PR14_bit            _BIT_ACCESS(SMT1PRH,6)
// SMT1PRH<PR15>
extern volatile __bit                   PR15                __at(0x24B7);	// @ (0x496 * 8 + 7)
#define                                 PR15_bit            _BIT_ACCESS(SMT1PRH,7)
// SMT1PRU<PR16>
extern volatile __bit                   PR16                __at(0x24B8);	// @ (0x497 * 8 + 0)
#define                                 PR16_bit            _BIT_ACCESS(SMT1PRU,0)
// SMT1PRU<PR17>
extern volatile __bit                   PR17                __at(0x24B9);	// @ (0x497 * 8 + 1)
#define                                 PR17_bit            _BIT_ACCESS(SMT1PRU,1)
// SMT1PRU<PR18>
extern volatile __bit                   PR18                __at(0x24BA);	// @ (0x497 * 8 + 2)
#define                                 PR18_bit            _BIT_ACCESS(SMT1PRU,2)
// SMT1PRU<PR19>
extern volatile __bit                   PR19                __at(0x24BB);	// @ (0x497 * 8 + 3)
#define                                 PR19_bit            _BIT_ACCESS(SMT1PRU,3)
// SMT1PRU<PR20>
extern volatile __bit                   PR20                __at(0x24BC);	// @ (0x497 * 8 + 4)
#define                                 PR20_bit            _BIT_ACCESS(SMT1PRU,4)
// SMT1PRU<PR21>
extern volatile __bit                   PR21                __at(0x24BD);	// @ (0x497 * 8 + 5)
#define                                 PR21_bit            _BIT_ACCESS(SMT1PRU,5)
// SMT1PRU<PR22>
extern volatile __bit                   PR22                __at(0x24BE);	// @ (0x497 * 8 + 6)
#define                                 PR22_bit            _BIT_ACCESS(SMT1PRU,6)
// SMT1PRU<PR23>
extern volatile __bit                   PR23                __at(0x24BF);	// @ (0x497 * 8 + 7)
#define                                 PR23_bit            _BIT_ACCESS(SMT1PRU,7)
// SMT1PRL<PR7>
extern volatile __bit                   _PR7                 __at(0x24AF);	// @ (0x495 * 8 + 7)  // Note: Changed by MikroE
#define                                 PR7_bit             _BIT_ACCESS(SMT1PRL,7)
// SMT1PRH<PR8>
extern volatile __bit                   _PR8                 __at(0x24B0);	// @ (0x496 * 8 + 0)  // Note: Changed by MikroE
#define                                 PR8_bit             _BIT_ACCESS(SMT1PRH,0)
// SMT1PRH<PR9>
extern volatile __bit                   _PR9                 __at(0x24B1);	// @ (0x496 * 8 + 1)  // Note: Changed by MikroE
#define                                 PR9_bit             _BIT_ACCESS(SMT1PRH,1)
// ADPREL<PRE0>
extern volatile __bit                   PRE0                __at(0x878);	// @ (0x10F * 8 + 0)
#define                                 PRE0_bit            _BIT_ACCESS(ADPREL,0)
// ADPREL<PRE1>
extern volatile __bit                   PRE1                __at(0x879);	// @ (0x10F * 8 + 1)
#define                                 PRE1_bit            _BIT_ACCESS(ADPREL,1)
// ADPREH<PRE10>
extern volatile __bit                   PRE10               __at(0x882);	// @ (0x110 * 8 + 2)
#define                                 PRE10_bit           _BIT_ACCESS(ADPREH,2)
// ADPREH<PRE11>
extern volatile __bit                   PRE11               __at(0x883);	// @ (0x110 * 8 + 3)
#define                                 PRE11_bit           _BIT_ACCESS(ADPREH,3)
// ADPREH<PRE12>
extern volatile __bit                   PRE12               __at(0x884);	// @ (0x110 * 8 + 4)
#define                                 PRE12_bit           _BIT_ACCESS(ADPREH,4)
// ADPREL<PRE2>
extern volatile __bit                   PRE2                __at(0x87A);	// @ (0x10F * 8 + 2)
#define                                 PRE2_bit            _BIT_ACCESS(ADPREL,2)
// ADPREL<PRE3>
extern volatile __bit                   PRE3                __at(0x87B);	// @ (0x10F * 8 + 3)
#define                                 PRE3_bit            _BIT_ACCESS(ADPREL,3)
// ADPREL<PRE4>
extern volatile __bit                   PRE4                __at(0x87C);	// @ (0x10F * 8 + 4)
#define                                 PRE4_bit            _BIT_ACCESS(ADPREL,4)
// ADPREL<PRE5>
extern volatile __bit                   PRE5                __at(0x87D);	// @ (0x10F * 8 + 5)
#define                                 PRE5_bit            _BIT_ACCESS(ADPREL,5)
// ADPREL<PRE6>
extern volatile __bit                   PRE6                __at(0x87E);	// @ (0x10F * 8 + 6)
#define                                 PRE6_bit            _BIT_ACCESS(ADPREL,6)
// ADPREL<PRE7>
extern volatile __bit                   PRE7                __at(0x87F);	// @ (0x10F * 8 + 7)
#define                                 PRE7_bit            _BIT_ACCESS(ADPREL,7)
// ADPREH<PRE8>
extern volatile __bit                   PRE8                __at(0x880);	// @ (0x110 * 8 + 0)
#define                                 PRE8_bit            _BIT_ACCESS(ADPREH,0)
// ADPREH<PRE9>
extern volatile __bit                   PRE9                __at(0x881);	// @ (0x110 * 8 + 1)
#define                                 PRE9_bit            _BIT_ACCESS(ADPREH,1)
// ADREF<PREF0>
extern volatile __bit                   PREF0               __at(0x8B0);	// @ (0x116 * 8 + 0)
